[{"published":"2014-02-16T01:30:19Z","link":"http://houston.pm.org/talks/2014talks/1402Talk/index.html","content":{"content":"<p>Random numbers are important in many areas of computing. A very important\napproach to generating random number sequences is Pseudo-Random Number\nGenerators. Robert Stone gives an overview of Pseudo-Random Number Generation,\nwith some explanation of Cryptographically Secure Pseudor-Random Number\nGenerators.  He also discusses some of the ways this can go wrong, including\nexamples from recent security news. He finishes up with information about Perl\nmodules that can be used for generating Pseudo-Random Number Sequences.</p>","type":"xhtml"},"category":"technical meeting","updated":"2014-02-16T01:30:19Z","id":"tag:houston.pm.org,2011-03:presentation:1402","title":"Notes for 'Pseudo-Random Number Generation - How it Works, What the CIA Knows, and What Options Exist in Perl?' posted."},{"published":"2014-01-22T04:28:50Z","content":"<div><p>Robert Stone will discuss pseudo-random number generation and Perl modules\ngenerating pseudo-random numbers. Given recent news about three letter agencies\nand random numbers, this should be a fascinating talk.</p>\n\n<p>HostGator will sponsor the meeting this month, so we will be meeting at their\n<a href=\"https://maps.google.com/maps?q=HostGator,+Houston&fb=1&gl=us&hq=HostGator,&hnear=0x8640b8b4488d8501:0xca0d02def365053b,Houston,+TX&cid=2141572779937723859&t=h&z=16&iwloc=A\">offices</a>\n(5005 Mitchelldale St #100, Houston, TX 77092) on Thursday, February 13 at 7pm.</p>\n</div>","title":"Pseudo-Random Number Generation - How it Works, What the CIA Knows, and What Options Exist in Perl?","id":"tag:houston.pm.org.2011-03:announce-20140121-8662","updated":"2014-01-22T04:28:50Z"},{"published":"2014-01-10T20:40:27Z","link":"http://houston.pm.org/talks/2014talks/1401Talk/index.html","content":{"content":"<p>\nRuth gives an overview of Library information systems and the work she did in migrating libraries\nfrom various systems to the open source Koha system. Perl's abilities to manipulate text-based\ndata efficiently was critical to this work.</p>","type":"xhtml"},"category":"technical meeting","updated":"2014-01-10T20:40:27Z","id":"tag:houston.pm.org,2011-03:presentation:1401","title":"Notes for 'Migrate ALL THE THINGS' posted."},{"published":"2013-12-10T18:02:06Z","content":"<div><p>In 2011, while working for ByWater Solutions, Ruth Bavousett converted over\nfifty libraries from diverse legacy library information system packages to\n<a href=\"http://koha-community.org\">Koha</a>. In this talk, she talks not only about\nthe code she wrote to handle this massive undertaking, but the mindset and\nprocesses necessary for consistent high-quality results not only for\nherself, but for teammates who followed in her footsteps.</p>\n\n<p>As usual, we'll meet at the cPanel offices, 3131 W. Alabama, between 6:30 and 7.\nAround 7, we'll go up to the training room for the meeting.</p>\n</div>","title":"January Meeting: Migrate ALL THE THINGS: Large Scale Library Data Manipulations with Perl","id":"tag:houston.pm.org.2011-03:announce-20131210-13628","updated":"2013-12-10T18:02:06Z"},{"published":"2013-12-10T17:48:43Z","content":"<div><p>For December, we are going to do a social meeting at a different location.\nWe'll meet at the Empire Cafe, 1732 Westheimer at 7pm, on Thursday, Dec. 12.\nThere should be plenty of parking behind the building.</p>\n\n<p>Expect lots of socializing and a little Perl.</p>\n</div>","updated":"2013-12-10T17:48:43Z","id":"tag:houston.pm.org.2011-03:announce-20131210-9637","title":"Houston.pm December Social Meeting"},{"link":"http://houston.pm.org/talks/2013talks/1311Talk/index.html","published":"2013-11-19T19:23:08Z","content":{"content":"<p>Bitcoin is a cryptocurrency based on a 2008 paper by a pseudonymous developer.\nThe creation an use of bitcoins is decentralized and based on strong\ncryptography. JD gives a high level explanation of how bitcoins work and how\nthey are used. Unlike most information you see on-line, JD also covers some of\nthe attacks that are possible against bitcoin.</p>","type":"xhtml"},"title":"Notes for 'Bitcoin Payment Processing' posted.","id":"tag:houston.pm.org,2011-03:presentation:1311","updated":"2013-11-19T19:23:08Z","category":"technical meeting"},{"published":"2013-10-25T20:02:56Z","content":"<div><p>For November's meeting, JD Lightsey has agreed to do a talk on how Bitcoin\ntransactions are processed. He'll include some examples of CPAN modules for\nBitcoin.</p>\n</div>","updated":"2013-10-25T20:02:56Z","id":"tag:houston.pm.org.2011-03:announce-20131025-1386","title":"Bitcoin Payment Processing"},{"link":"http://houston.pm.org/talks/2013talks/1310Talk/index.html","published":"2013-10-19T04:42:46Z","content":{"content":"<p>brian d foy explains some of Perl's more powerful regular expression features using\na regex written by Randal Schwartz to parse JSON.</p>","type":"xhtml"},"title":"Notes for 'A JSON parser regex' posted.","id":"tag:houston.pm.org,2011-03:presentation:1310","updated":"2013-10-19T04:42:46Z","category":"technical meeting"},{"published":"2013-10-06T00:46:39Z","content":"<div><p>brian d foy is in town and has agreed to talk at our meeting. To accommodate\nhis schedule, we're moving the meeting from it's regular date to October 17th.\nWe will be meeting at our regular location (cPanel) at our regular time (7pm).</p>\n\n<p>brian will talk about Randal Schwartz's JSON parser regex. This will allow a\ngood discussion of some of the newer features of Perl's regular expressions.</p>\n\n<p>Some of the attendees will be going out for drinks with brian after the\nmeeting if he feels up for it.</p>\n</div>","updated":"2013-10-06T00:46:39Z","id":"tag:houston.pm.org.2011-03:announce-20131005-15062","title":"October 17 Technical Meeting: brian d foy"},{"link":"http://houston.pm.org/talks/2013talks/1309Talk/index.html","published":"2013-09-16T01:51:13Z","content":{"content":"<p>This meeting was intended to be another hack-a-thon for those people who had\nprojects to work on. For those relatively new to Perl, Wade was going to run a\nhelp session to answer questions and go over Perl basics.</p>","type":"xhtml"},"title":"Notes for 'Hack-a-thon and Perl Help Session' posted.","id":"tag:houston.pm.org,2011-03:presentation:1309","updated":"2013-09-16T01:51:13Z","category":"technical meeting"},{"published":"2013-09-11T00:31:17Z","content":"<div><p>We'll meet at the cPanel, Inc. offices on Thursday, September 12. As\nusual, we will meet in the lobby at the top of the parking garage\nbetween 6:30pm and 7pm. We'll go up to the meeting room around 7pm.</p>\n\n<p>Parking is free on top of the parking garage.</p>\n\n<p>The meeting will be in two parts:</p>\n\n<ol>\n  <li>Hack-a-thon:<ul>\n    <li>If you've got something you are working on and you could use some help, bring it.</li>\n    <li>If you are willing to help someone work on their project come on.</li>\n   </ul>\n  <li>Perl help session<ul>\n    <li>Focused on people learning Perl who are having trouble moving forward.</li>\n    <li>Part tips/tricks/traps, part answering questions.</li>\n   </ul>\n</ol>\n\n<p>I'll run the second part on one side of the room. Anyone who would like\nto join, either to help or to learn is welcome.</p>\n</div>","updated":"2013-09-11T00:31:17Z","id":"tag:houston.pm.org.2011-03:announce-20130910-16142","title":"Houston.pm September Meeting: Hack-a-thon and Help Session"},{"link":"http://houston.pm.org/talks/2013talks/1308Talk/index.html","published":"2013-08-11T18:23:36Z","content":{"content":"<p>Brett explains how to use the Redis data store as a work queue. Many of the\nfeatures of Redis support producer-consumer queuing.</p>","type":"xhtml"},"title":"Notes for 'An Introduction to Work Queuing with Redis.pm' posted.","id":"tag:houston.pm.org,2011-03:presentation:1308","updated":"2013-08-11T18:23:36Z","category":"technical meeting"},{"published":"2013-07-18T16:49:30Z","content":"<div><p>Brett Estrade has tentatively volunteered to present an introduction to task\nqueuing and messaging with the Redis.pm module.</p>\n</div>","updated":"2013-07-18T16:49:30Z","id":"tag:houston.pm.org.2011-03:announce-20130718-3881","title":"An Introduction to Work Queuing with Redis.pm"},{"link":"http://houston.pm.org/talks/2013talks/1307Talk/index.html","published":"2013-07-13T01:01:43Z","content":{"content":"<p>We opened the conference room for anyone to work on their projects or help\nothers as a Hack-a-thon. Unlike the previous attempt, no <em>official</em>\nproject was specified that we would work on.</p>","type":"xhtml"},"title":"Notes for 'Houston.pm July Hack-a-thon' posted.","id":"tag:houston.pm.org,2011-03:presentation:1307","updated":"2013-07-13T01:01:43Z","category":"technical meeting"},{"published":"2013-06-23T03:23:30Z","content":"<div>\n<p>For July, we will be trying something different. We are having a\nmini-Hack-a-thon.  The idea is to work on Perl projects with other people from\nthe group. You can work on your own code, an open source project, or help\nsomeone with their project.</p>\n\n<p>Since Perl developers with different levels of experience will be on-hand,\nthis is a great opportunity to get advice or help on everything from design\nthrough coding techniques, documentation ideas, testing suggestion, or most\nanything else.</p>\n\n<p>This meeting will be held at the cPanel offices at 3131 W. Alabama, where\nwe normally have the technical meetings. We'll be hacking from around 6 to 9.\nSince there's no presentation, people may be wandering in a different times. If\nthere is no one in the lobby when you get there, press the button and have\nthem get in touch with Todd Rinaldo.</p>\n\n<p>Hope to see you there. If this works out, we may be able to make this a\nsemi-regular occurrence.</p>\n</div>","updated":"2013-06-23T03:23:30Z","id":"tag:houston.pm.org.2011-03:announce-20130622-3806","title":"Hack-a-thon"},{"link":"http://houston.pm.org/talks/2013talks/1306Talk/index.html","published":"2013-06-14T19:31:35Z","content":{"content":"<p>Reini Urban covered some of the background and low-level details of one of the\nefforts to modernize the compiler and run-time for Perl 5.</p>","type":"xhtml"},"title":"Notes for 'p2: The Design and VM of a Next Generation Perl (11 = 5+6)' posted.","id":"tag:houston.pm.org,2011-03:presentation:1306","updated":"2013-06-14T19:31:35Z","category":"technical meeting"},{"published":"2013-05-26T19:23:00Z","content":"<div><p>Reini Urban will present his work on a next generation version of Perl.</p>\n\n<p>Some are concerned with the recent direction of Perl, with Perl 5 holding\nback from new features in the name of backwards compatibility, and Perl 6\ncontinuing in a long-term research and development mode. P2 is one of the\nattempts to build a Perl 11 (5+6) that combines the best of both.</p>\n</div>","updated":"2013-05-26T19:23:00Z","id":"tag:houston.pm.org.2011-03:announce-20130526-13280","title":"June Houston.pm Meeting: p2: The Design and VM of a Next Generation Perl (11 = 5+6)"},{"published":"2013-05-01T00:32:06Z","content":"<div><p>Schwern is in town, so we'll have our May meeting early. A social meeting at\nBig Woodrow's at 3111 Chimney Rock Rd. Come join us this Thursday (May 2) after\n6:30pm for food, drinks, and conversation with Schwern. We will have a\nreservation under the name Wade Johnson.</p>\n\n<p>We look forward to seeing you there.</p>\n</div>","title":"Social with Schwern at Big Woodrow's","id":"tag:houston.pm.org.2011-03:announce-20130430-22065","updated":"2013-05-01T00:32:06Z"},{"published":"2013-04-24T02:48:28Z","content":"<div><p>We're having a special social meeting this Thursday (April 25) at Little Pappasito's to socialize\nwith brian d foy. brian is in town this week doing training and we can't pass up a\nchance like this.</p>\n\n<p>The address is 2536 Richmond (at Kirby). We have a reservation under \"Wade Johnson\" starting\nat 6:30 pm. Show up any time after that for a little socializing. See you there.</p>\n</div>","updated":"2013-04-24T02:48:28Z","id":"tag:houston.pm.org.2011-03:announce-20130423-15410","title":"Special Houston.pm Social Meeting with brian d foy"},{"link":"http://houston.pm.org/talks/2013talks/1303Talk/index.html","published":"2013-03-17T17:08:52Z","content":{"content":"<p>Charles Boyd introduces the Pari/GP library and discusses how its design makes\ncreating bindings to the library easier. He also discusses some current Perl\nbindings to the library, as well as future directions for this work.</p>","type":"xhtml"},"title":"Notes for 'Pari/GP and Perl - Past, Present and Future' posted.","id":"tag:houston.pm.org,2011-03:presentation:1303","updated":"2013-03-17T17:08:52Z","category":"technical meeting"},{"published":"2013-03-09T16:28:18Z","content":"<div><p>Charles Boyd will introduce the Pari/GP library and discuss how its\ndesign makes creating bindings to the library easier. He will also\ndiscuss some current Perl bindings to the library, as well as future\ndirections for this work.</p>\n</div>","updated":"2013-03-09T16:28:18Z","id":"tag:houston.pm.org.2011-03:announce-20130309-26074","title":"Pari/GP and Perl - Past, Present and Future"},{"link":"http://houston.pm.org/talks/2013talks/1302Talk/index.html","published":"2013-03-03T04:22:23Z","content":{"content":"<p>JD Does an early trial run of his talk about auditing CPAN modules for vulnerabilities.\nHe covers both techniques for simple security audits and the process of responsible\ndisclosure of those vulnerabilities to the author.</p>","type":"xhtml"},"title":"Notes for 'Auditing CPAN for Security Vulnerabilities' posted.","id":"tag:houston.pm.org,2011-03:presentation:1302","updated":"2013-03-03T04:22:23Z","category":"technical meeting"},{"published":"2013-01-23T23:11:17Z","content":"<div>JD Lightsey will test-drive his YAPC::NA talk about auditing CPAN and Open Source\nPerl code for security vulnerabilities. If you can't make YAPC this year, you\nhave a chance to see this talk ahead of time.\n</div>","updated":"2013-01-23T23:11:17Z","id":"tag:houston.pm.org.2011-03:announce-20130123-25884","title":"Auditing CPAN for Security Vulnerabilities"},{"link":"http://houston.pm.org/talks/2013talks/1301Talk/index.html","published":"2013-01-21T04:30:17Z","content":{"content":"<p>Many interesting projects come out of someone <em>scratching their own\nitch</em>. Jay Vogt presented a web-based program for querying a bug-tracking\nsystem he uses at work. Although the original system allowed people to enter\nall of the information needed to track issues, the query interface was not\npowerful enough for some needs.</p>","type":"xhtml"},"title":"Notes for 'A Web-based Defect Management/Tracking System Developed Non-Programmer' posted.","id":"tag:houston.pm.org,2011-03:presentation:1301","updated":"2013-01-21T04:30:17Z","category":"technical meeting"},{"published":"2013-01-03T05:05:48Z","content":"<div><p>Jay Vogt will introduce a defect tracking system he developed in Perl\nfor his day job about 5 years ago.</p>\n</div>","updated":"2013-01-03T05:05:48Z","id":"tag:houston.pm.org.2011-03:announce-20130102-17498","title":"Demo of a Web-based Defect Management/Tracking System Developed in Perl by a Non-Programmer"},{"link":"http://houston.pm.org/talks/2012talks/1211Talk/index.html","published":"2012-12-27T00:54:01Z","content":{"content":"<p>This month's meeting was mostly a discussion of small scripts and techniques\nthat different people use for getting work done in their day.</p>","type":"xhtml"},"title":"Notes for 'Automating Daily Tasks' posted.","id":"tag:houston.pm.org,2011-03:presentation:1211","updated":"2012-12-27T00:54:01Z","category":"technical meeting"},{"published":"2012-12-04T02:57:49Z","content":"<div><p>December is time for one of our social meetings.</p>\n\n<p>Once again, we will be meeting at the\n<a href=\"http://www.blacklabradorpub.com/lab_about_us.html\">Black Labrador</a> on Montrose,\nnear Richmond.  As usual, the food is good, and the conversation will be interesting. We do\nnot limit the discussion to only Perl at the social meetings. This is a good opportunity\nto meet some of your fellow Perl Mongers and learn about some of their interests.</p>\n\n<p>We'll meet around 7pm on Thursday, December 13. Tell the hostess you are meeting Wade\nJohnson or the Perl group. I'll have a reservation for that time. Hope to see you  there.</p>\n</div>","updated":"2012-12-04T02:57:49Z","id":"tag:houston.pm.org.2011-03:announce-20121203-12292","title":"Houston.pm December Social Meeting"},{"published":"2012-10-30T12:36:23Z","content":"<div><p>The next Houston.pm meeting is on November 8, a week from this Thursday.\nThis month's meeting will be a little different. I will be leading a\ndiscussion of tools and tricks for automating daily tasks.</p>\n\n<p>The quality of the meeting will depend on you. Everyone should bring\ntheir favorite Perl snippets, quick scripts, and one-liners. The only\ntheme is <em>Getting Things Done</em>. If the code solves a problem for you,\nit is a subject for the meeting.</p>\n\n<p>As usual, we will meet at 3131 W. Alabama St. in the lobby area between\n6:40pm and 7pm on Thursday night. We'll go up to the conference room at\n7pm. Parking on top of the parking garage is free.</p>\n</div>","title":"November Houston.pm Technical Meeting","id":"tag:houston.pm.org.2011-03:announce-20121030-23983","updated":"2012-10-30T12:36:23Z"},{"published":"2012-10-14T20:36:17Z","link":"http://houston.pm.org/talks/2012talks/1210Talk/index.html","content":{"content":"<p>Many people use Perl for manipulating text files. Erin explains several of her\nfavorite small techniques in this area.</p>","type":"xhtml"},"category":"technical meeting","updated":"2012-10-14T20:36:17Z","id":"tag:houston.pm.org,2011-03:presentation:1210","title":"Notes for 'Bag of Tricks' posted."},{"link":"http://houston.pm.org/talks/2012talks/1209Talk/index.html","published":"2012-10-14T20:21:24Z","content":{"content":"<p>Fraser has a business providing a web-based administration system for\nbusinesses providing CAM services. In this talk, he presents some details\non the Perl code that drives the system.</p>","type":"xhtml"},"title":"Notes for 'A Small On Line Wellness Business Built Using Perl' posted.","id":"tag:houston.pm.org,2011-03:presentation:1209","updated":"2012-10-14T20:21:24Z","category":"technical meeting"},{"published":"2012-09-29T13:17:11Z","content":"<div><p>Erin Sch&#246;nhals has agreed to present for this month's meeting at 7pm on October 11. Here's her explanation of the topic:</p>\n\n<p>By popular demand, for Houston.pm's October meeting I will be\npresenting some small examples from a bag of tricks useful for taking\non a number of file manipulation tasks, more specifically those suited\nto manipulating human readable text.  Such tricks include but are not\nlimited to:</p>\n\n<ul>\n    <li>Quick and easy recursive file operations</li>\n    <li>Editing files in-place; or, a better alternative</li>\n    <li>A blurb on ispell and Lingua::Spelling::Alternative</li>\n    <li>Some notes on Template::Toolkit</li>\n    <li>Handling errors gracefully in the midst of a large pile of work</li>\n    <li>Mass renaming of files; good for managing media collections!</li>\n</ul>\n\n<p>Slides and example code will be made available online after the\nmeeting.  Each example will be introduced with enough explanation to\nhelp grasp the most important moving pieces.  Plenty of room will be\nleft over at the end of the presentation for Q&amp;A.  Hopefully the keen\nattendee will be able to string these methods together with confidence.</p>\n\n<p>I sure do hope to see you then!</p>\n\n<hr />\n<p>As usual, we will meet at 3131 W. Alabama St. The presentation starts\nat 7pm. We'll gather in the lobby on top of the parking garage between\n6:40pm and 7pm, and go to the meeting from there.</p>\n</div>","updated":"2012-09-29T13:17:11Z","id":"tag:houston.pm.org.2011-03:announce-20120929-1089","title":"Bag of Tricks"},{"link":"http://houston.pm.org/talks/2012talks/1207Talk/index.html","published":"2012-09-02T18:52:23Z","content":{"content":"<p>Mark presented an overview of using the git version control system with an\nemphasis on what the average Perl Hacker needs to know. Since this was a\npreview of the talk he planned to give at OSCON, the audience was able to help\nimprove the talk. The audience was a good mix of people with little or no git\nexperience as well as old-hands. The audience appeared to enjoy the talk and\nenjoyed helping in the improvements.</p>","type":"xhtml"},"title":"Notes for 'Intro to Git for Perl Hackers' posted.","id":"tag:houston.pm.org,2011-03:presentation:1207","updated":"2012-09-02T18:52:23Z","category":"technical meeting"},{"published":"2012-09-02T18:36:06Z","link":"http://houston.pm.org/talks/2012talks/1206Talk/index.html","content":{"content":"<p>Wade presented more high-level testing tools and strategies for testing,\nrather than the normal <em>introduction to Perl unit testing</em> which\nwe have done in the past.</p>","type":"xhtml"},"category":"technical meeting","updated":"2012-09-02T18:36:06Z","id":"tag:houston.pm.org,2011-03:presentation:1206","title":"Notes for 'Perl Unit Testing: Tools and Techniques' posted."},{"published":"2012-09-02T18:06:38Z","content":"<div><p>Fraser Baker describes his Perl-based business. Where most of our talks\ncover technology and interesting techniques, Fraser will present about how\nPerl makes his business possible.</p>\n</div>","title":"A Small On Line Wellness Business Built Using Perl","id":"tag:houston.pm.org.2011-03:announce-20120902-9","updated":"2012-09-02T18:06:38Z"},{"published":"2012-07-07T03:34:00Z","content":"<div>Mark Allen will give us a preview of his OSCON presentation for this year.\n</div>","updated":"2012-07-07T03:34:00Z","id":"tag:houston.pm.org.2011-03:announce-201202d02d-7","title":"Git for the Perl Hacker"},{"link":"http://houston.pm.org/talks/2012talks/1205Talk/index.html","published":"2012-06-04T01:49:26Z","content":{"content":"<p>Mark indulged his curiosity about which Platform as a Service providers\ndo a good job of supporting Perl.</p>","type":"xhtml"},"title":"Notes for 'Perl Platform as a Service Shootout' posted.","id":"tag:houston.pm.org,2011-03:presentation:1205","updated":"2012-06-04T01:49:26Z","category":"technical meeting"},{"published":"2012-06-04T00:24:24Z","link":"http://houston.pm.org/talks/2012talks/1204Talk/index.html","content":{"content":"<p>Reini describes a script he uses to test a large number of Perl versions as part\nof the development of the Perl compiler.</p>","type":"xhtml"},"category":"technical meeting","updated":"2012-06-04T00:24:24Z","id":"tag:houston.pm.org,2011-03:presentation:1204","title":"Notes for 'App::perlall' posted."},{"link":"http://houston.pm.org/talks/2012talks/1203Talk/index.html","published":"2012-06-04T00:17:41Z","content":{"content":"<p>brian presents an early draft of the <em>Advanced Modulinos</em> talk he plans\nto give this conference season.</p>","type":"xhtml"},"title":"Notes for 'Advanced Modulinos' posted.","id":"tag:houston.pm.org,2011-03:presentation:1203","updated":"2012-06-04T00:17:41Z","category":"technical meeting"},{"published":"2012-05-07T12:25:47Z","content":"<div><div>Mark Allen presents his <acronym title=\"Yet Another Perl Conference\">YAPC</acronym>::<acronym title=\"North America\">NA</acronym>\ntalk comparing cloud computing services for the May Houston.pm meeting (May 10). The presentation\nwill begin at 7pm at 3131 W. Alabama, as usual.</div>\n\n<div>Someone will be available in the lobby between 6:40pm and 7pm. We'll go up to the meeting\ntogether. As always, there is free parking on top of the parking garage.</div>\n</div>","updated":"2012-05-07T12:25:47Z","id":"tag:houston.pm.org.2011-03:announce-201202d02d-5","title":"Perl Platform as a Service Shootout"},{"published":"2012-04-06T01:55:24Z","content":"<div><p>Our own Reini Urban presents the <code>App::Perlall</code> script, which simplifies working and testing with multiple Perl versions.</p>\n</div>","title":"App::PerlAll","id":"tag:houston.pm.org.2011-03:announce-201202d02d-4","updated":"2012-04-09T18:30:24Z"},{"published":"2012-02-18T23:52:23Z","link":"http://houston.pm.org/talks/2012talks/1202Talk/index.html","content":{"content":"<p>Mark Allen introduced the Dist::Zilla distribution building module from the point of view of someone who is new to the module.</p>","type":"xhtml"},"category":"technical meeting","updated":"2012-02-18T23:52:23Z","id":"tag:houston.pm.org,2011-03:presentation:1202","title":"Notes for 'DistZilla from one newb to another' posted."},{"link":"http://houston.pm.org/talks/2012talks/1201Talk/index.html","published":"2012-01-19T03:21:31Z","content":{"content":"<p>Nicolas presented an overview of object oriented programming in Perl. After\ncovering the basics, he surveyed the different Perl modules that provide\nsupport for OO in Perl.</p>","type":"xhtml"},"title":"Notes for 'Perl Object?' posted.","id":"tag:houston.pm.org,2011-03:presentation:1201","updated":"2012-01-19T03:21:31Z","category":"technical meeting"},{"published":"2012-01-04T02:26:27Z","content":"<div><p>This month, Nicolas Rochelemagne will be talking about object-oriented programming in Perl.</p>\n<p>As usual, the meeting will be located at 3131 W. Alabama St. and will start at 7pm.\nWe will meet in the lobby on the parking level between 6:40 and 7pm.\n</p></div>","updated":"2012-01-04T02:26:27Z","id":"tag:houston.pm.org.2011-03:announce-201202d02d-1","title":"Perl Objects"},{"published":"2011-12-06T01:17:17Z","content":"<div><p>This Thursday is the December social meeting for Houston.pm.</p>\n\n<p>As usual, we will meet at the Black Labrador around 7pm. Ask for \"Wade\"\nor \"the Perl Group\" and they'll point you to us.</p>\n\n<p>As with all social meetings, there will be good food, good drink, and\nplenty of conversation (on Perl and not). All are welcome, whether\nyou've been to a technical meeting or not. Here is a chance to meet and\nchat with other people interested in Perl.</p>\n\n<p>I have had a couple of people say that they weren't sure where the\nBlack Lab was located. It is on Montrose, just north of Richmond. There\nis usually plenty of parking in the back.\n(<a href=\"http://maps.google.com/maps?q=The+Black+Labrador,+Houston,+TX&amp;hl=en&amp;sll=37.0625,-95.677068&amp;sspn=56.112526,92.021484&amp;vpsrc=0&amp;hq=The+Black+Labrador,+Houston,+TX&amp;t=m&amp;z=15>map</a>)</p>\n</div>","title":"Houston.pm December Social Meeting","id":"tag:houston.pm.org.2011-03:announce-201102d02d-12","updated":"2011-12-06T01:17:17Z"},{"published":"2011-11-21T05:09:25Z","link":"http://houston.pm.org/talks/2011talks/1111Talk/index.html","content":{"content":"<p>brian gave a presentation listing some of the Perl idioms and tricks\nhe found during an examination of some of his code. This presentation\nwas originally presented at <acronym title=\"Yet Another Perl Conference\">YAPC</acronym>::Brasil.</p>","type":"xhtml"},"category":"technical meeting","updated":"2011-11-21T05:09:25Z","id":"tag:houston.pm.org,2011-03:presentation:1111","title":"Notes for 'My Perl Bag of Tricks' posted."},{"published":"2011-11-06T02:00:58Z","content":"<div><p>We have an unusual opportunity this month to have brian d foy talk to the\ngroup. Many of you will recognize brian's name as the author of several Perl\nbooks, including <em>Learning Perl</em>, <em>Intermediate Perl</em>,\n<em>Mastering Perl</em>, and <em>Effective Perl Programming</em>. He also\npublished <em>The Perl Review</em>. He has consulted and trained in Perl as a\npartner at Stonehenge consulting.</p>\n\n<p>Since he is only in town for a couple of days in the third week of\nNovember we are delaying the meeting by a week. This is a chance to\nhear a real expert in Perl speak, and you don't want to miss it.</p>\n\n<p>Although we always request that you RSVP if you plan to be there, this\ntime we may be packed. Let us know as soon as possible, if you plan to\nattend.</p>\n\n<p>As always, we will meet in the lobby at 3131 W. Alabama between 6:40\nand 7pm. At which point we will go upstairs to the meeting. If you\narrive later than that, there is a phone in the lobby area that calls\nthe cPanel tech support team. They can get a message to us to come get\nyou.</p>\n</div>","title":"November 17: Meeting with brian d foy","id":"tag:houston.pm.org.2011-03:announce-201102d02d-11","updated":"2011-11-06T02:00:58Z"},{"published":"2011-10-24T03:32:27Z","link":"http://houston.pm.org/talks/2011talks/1110Talk/index.html","content":{"content":"<p>Perl programs are normally compiled from script into memory and executed\nwithout a separate compilation step. The standard distribution once had a\nprogram that could compile as Perl script into a standalone executable. In this\ntalk, Reini Urban describes the Perl compiler and some of the issues with\nupdating this program to modern Perl versions.</p>","type":"xhtml"},"category":"technical meeting","updated":"2011-10-24T03:32:27Z","id":"tag:houston.pm.org,2011-03:presentation:1110","title":"Notes for 'The Perl Compiler' posted."},{"link":"http://houston.pm.org/talks/2011talks/1109Talk/index.html","published":"2011-10-24T00:03:02Z","content":{"content":"<p>Brett talked about the Qore programming language. The syntax of the\nlanguage has some elements in common with Perl. On the other side, Qore has\nsome strong support for concurrency as a fundamental feature.</p>\n\n<p>Next, Jake described some work he has done recently for converting ranges\nof IP addresses in various forms into a set of IP addresses. This talk was\nmore low-level than most presentations.</p>\n\n<p>Finally, we had a series of lightning talks that covered several different\ntopics.</p>","type":"xhtml"},"title":"Notes for 'The Qore Language for Perl Programmers' and 'Bit Hacks on IP Ranges' posted.","id":"tag:houston.pm.org,2011-03:presentation:1109","updated":"2011-10-24T00:03:02Z","category":"technical meeting"},{"published":"2011-08-15T23:43:24Z","link":"http://houston.pm.org/talks/2011talks/1108Talk/index.html","content":{"content":"<p>Mark Allen will be presenting the \"Intro to Dancer\" talk he gave at OSCON 2011. If he has time, Mark has also offered to give a quick overview of some of the Perl information he learned at OSCON.</p>","type":"xhtml"},"category":"technical meeting","updated":"2011-08-15T23:43:24Z","id":"tag:houston.pm.org,2011-03:presentation:1108","title":"Notes for 'Intro to Dancer' posted."},{"published":"2011-08-08T23:44:15Z","content":"<div><p>Our next technical meeting will be August 11, 2011.\nAs usual, the meeting will start at 3131 W. Alabama St. at 7pm.</p>\n\n<p>Mark Allen will be presenting the <em>Intro to Dancer</em> talk he gave at\nOSCON 2011. If he has time, Mark has also offered to give a quick\noverview of things he learned at OSCON. If you've never been to OSCON\nand would like to know what it's like, you should be there.</p>\n\n<p>Someone (probably me) will be in the lobby on the parking level\nstarting about 6:40pm collecting people. We'll make our way upstairs to\nthe meeting room.</p>\n</div>","title":"Intro to Dancer with Mark Allen","id":"tag:houston.pm.org.2011-03:announce-201102d02d-8","updated":"2011-08-08T23:44:15Z"},{"published":"2011-08-08T12:30:24Z","link":"http://houston.pm.org/talks/2011talks/1107Talk/index.html","content":{"content":"<p>Gordon Child presented the Cobbler installation system. It supports rapid deployment\nand configuration of servers via a network boot.</p>","type":"xhtml"},"category":"technical meeting","updated":"2011-08-08T12:30:24Z","id":"tag:houston.pm.org,2011-03:presentation:1107","title":"Notes for 'Cooking with Cobbler' posted."},{"link":"http://houston.pm.org/talks/2011talks/1105Talk/index.html","published":"2011-07-11T03:49:11Z","content":{"content":"<p>In this talk, Wade introduces the basics of automated testing assuming little\nknowledge of the Perl testing culture. The purpose of the presentation is\nnot to make you an expert tester, but to introduce the concepts, tools, and\nreasoning behind automated testing in Perl.</p>","type":"xhtml"},"title":"Notes for 'Introduction to Perl: Testing' posted.","id":"tag:houston.pm.org,2011-03:presentation:1105","updated":"2011-07-11T03:49:11Z","category":"technical meeting"},{"published":"2011-04-25T03:22:26Z","link":"http://houston.pm.org/talks/2011talks/1104Talk/index.html","content":{"content":"<p>Gordon described the problem with testing Web Applications. He demonstrated\nusing Selenium to test applications by automating different browsers to\nactually execute the web application.</p>","type":"xhtml"},"category":"technical meeting","updated":"2011-04-25T03:22:26Z","id":"tag:houston.pm.org,2011-03:presentation:1104","title":"Notes for 'Automated Browser Interaction Using WWW::Selenium' posted."},{"link":"http://houston.pm.org/talks/2011talks/1103Talk/index.html","published":"2011-03-13T18:48:17Z","content":{"content":"<p>Nick Koston explored using Devel::NYTProf, Benchmark, and Data::Dumper to\noptimize Perl code. He explored some of the reasons that Perl code can be slow,\nand how to fix it.</p>","type":"xhtml"},"title":"Notes for 'Your Perl is Slow (and it does not have to be)' posted.","id":"tag:houston.pm.org,2011-03:presentation:1103","updated":"2011-03-13T18:48:17Z","category":"technical meeting"},{"published":"2011-03-13T18:29:44Z","link":"http://houston.pm.org/talks/2010talks/1011Talk/index.html","content":{"content":"<p>Erin describes the new Filesys::POSIX module that provides a POSIX-compliant\nvirtual file system in Perl.</p>","type":"xhtml"},"category":"technical meeting","updated":"2011-03-13T18:29:44Z","id":"tag:houston.pm.org,2011-03:presentation:1011","title":"Notes for 'Filesys::POSIX -- A real, in-memory filesystem written entirely in Perl' posted."}]